attacker145/CC3200-IoT/main.c
        case SL_NETAPP_IP_LEASED_EVENT:
        {
            SET_STATUS_BIT(g_ulStatus, STATUS_BIT_IP_LEASED);

            //
            // Information about the IP-Leased details(like IP-Leased,lease-time,
            // mac etc) will be available in 'SlIpLeasedAsync_t' - Applications
            // can use it if required
            //
            // SlIpLeasedAsync_t *pEventData = NULL;
            // pEventData = &pNetAppEvent->EventData.ipLeased;
            //

        }
        break;

        case SL_NETAPP_IP_RELEASED_EVENT:
        {
            CLR_STATUS_BIT(g_ulStatus, STATUS_BIT_IP_LEASED);

            //
            // Information about the IP-Released details (like IP-address, mac
            // etc) will be available in 'SlIpReleasedAsync_t' - Applications
            // can use it if required
            //
            // SlIpReleasedAsync_t *pEventData = NULL;
            // pEventData = &pNetAppEvent->EventData.ipReleased;
            //
        }
        break;

        default:
        {
            UART_PRINT("[NETAPP EVENT] Unexpected event [0x%x] \n\r",
                       pNetAppEvent->Event);
        }
        break;
    }
}

void concat(char *str1,char *str2)
{
    char *conc=str1;

    while(*str1!='\0')
        str1++;

    *str1=' ';
    ++str1;

    while(*str2!='\0')
    {
        *str1=*str2;
        str1++,str2++;
    }

    *str1='\0';
    printf("Concatenated String:\n");
    puts(conc);

}

//*****************************************************************************
//
//! \brief This function handles HTTP server events
//!
//! \param[in]  pServerEvent - Contains the relevant event information
//! \param[in]    pServerResponse - Should be filled by the user with the
//!                                      relevant response information
//!
//! \return None
//!
//****************************************************************************
void SimpleLinkHttpServerCallback(SlHttpServerEvent_t *pSlHttpServerEvent, 
                                SlHttpServerResponse_t *pSlHttpServerResponse)
{
    switch (pSlHttpServerEvent->Event)
    {
        case SL_NETAPP_HTTPGETTOKENVALUE_EVENT:     // Get data from the server
        {
            unsigned char *ptr;
            unsigned char *ptraccX;
            unsigned char *ptraccY;
            unsigned char *ptraccZ;
            unsigned char *uart;
            //unsigned char *tokenName;
            ptr = pSlHttpServerResponse->ResponseData.token_value.data;     // initialize pointer to location data: _u8     *data;
            pSlHttpServerResponse->ResponseData.token_value.len = 0;        // initialize length to zero
            UART_PRINT("\n\n\rHTTP_GET Tocken:\t %s",ptr);  // add this line only. Print string pointed by ptr. Basically .data will be printed
            if(memcmp(pSlHttpServerEvent->EventData.httpTokenName.data, 
                    GET_token_TEMP, strlen((const char *)GET_token_TEMP)) == 0) //__SL_G_UTP
            {
                float fCurrentTemp;
                TMP006DrvGetTemp(&fCurrentTemp);        // Get the temperature value and write it to fCurrentTemp
                char cTemp = (char)fCurrentTemp;        // 8 bit temperature value
                short sTempLen = itoa(cTemp,(char*)ptr);// Convert integer to ASCII in decimal base
                ptr[sTempLen++] = ' ';
                ptr[sTempLen] = 'F';
                pSlHttpServerResponse->ResponseData.token_value.len += sTempLen;

                //********************************************************************
                Report("\n\r Temperature HEX: \t");
                MAP_UARTCharPut(CONSOLE, (unsigned char) cTemp);
                Report("\n\r");
                //********************************************************************


            }

            if(memcmp(pSlHttpServerEvent->EventData.httpTokenName.data, 
                      GET_token_UIC, strlen((const char *)GET_token_UIC)) == 0)
            {
                if(g_iInternetAccess==0)
                    strcpy((char*)pSlHttpServerResponse->ResponseData.token_value.data,"1");    // LED ON
                else
                    strcpy((char*)pSlHttpServerResponse->ResponseData.token_value.data,"0");    // LED OFF
                pSlHttpServerResponse->ResponseData.token_value.len =  1;
            }

            if(memcmp(pSlHttpServerEvent->EventData.httpTokenName.data, 
                       GET_token_ACC, strlen((const char *)GET_token_ACC)) == 0)
            {

                //unsigned char *str3;
                //int i=0;
                ReadAccSensor(); //float *pfCurrTemp
                ptraccX = pSlHttpServerResponse->ResponseData.token_value.data;
                //ptraccY = pSlHttpServerResponse->ResponseData.token_value.data;
                //ptraccZ = pSlHttpServerResponse->ResponseData.token_value.data;
                signed char cAccXT1, cAccYT1, cAccZT1;
                //unsigned char cAccXTu, cAccYTu, cAccZTu;
                unsigned char cAccYTu, cAccZTu;
                //_u8     *cAccXT2; //_u8     *data;
                _u8     *cAccYT2;
                _u8     *cAccZT2;   //_u8     *data;

                BMA222ReadNew(&cAccXT1, &cAccYT1, &cAccZT1);

                //cAccXTu = (unsigned char) cAccXT1;
                cAccYTu = (unsigned char) cAccYT1;
                cAccZTu = (unsigned char) cAccZT1;

                //cAccXT2 = &cAccXTu;
                cAccYT2 = &cAccYTu;
                cAccZT2 = &cAccZTu;

                //ptraccX = cAccXT2;
                ptraccY = cAccYT2;
                ptraccZ = cAccZT2;

                short sLenAccX = itoa(g_accXIntervalSum,(char*)ptraccX);// Convert integer to ASCII in decimal base. Convert x-axis value to a decimal string.
                short sLenAccY = itoa(g_accYIntervalSum,(char*)ptraccY);// String that contains Y-axis data
                ptraccY[sLenAccY++] = ' ';
                short sLenAccZ = itoa(g_accZIntervalSum,(char*)ptraccZ);// String that contains Z-axis data
                ptraccY[sLenAccZ++] = ' ';

                ptraccX[sLenAccX++] = ' ';
                ptraccX[sLenAccX++] = ' ';
                ptraccX[sLenAccX++] = 'X';
                ptraccX[sLenAccX++] = '-';
                ptraccX[sLenAccX++] = 'a';
                ptraccX[sLenAccX++] = 'x';
                ptraccX[sLenAccX++] = 'e';
                ptraccX[sLenAccX++] = 's';
                ptraccX[sLenAccX++] = ' ';
                ptraccX[sLenAccX++] = ' ';
                ptraccX[sLenAccX++] = ' ';


                ptraccX[sLenAccX++] = ptraccY[0];
                ptraccX[sLenAccX++] = ptraccY[1];
                ptraccX[sLenAccX++] = ptraccY[2];

                ptraccX[sLenAccX++] = ' ';
                ptraccX[sLenAccX++] = ' ';
                ptraccX[sLenAccX++] = 'Y';
                ptraccX[sLenAccX++] = '-';
                ptraccX[sLenAccX++] = 'a';
                ptraccX[sLenAccX++] = 'x';
                ptraccX[sLenAccX++] = 'e';
                ptraccX[sLenAccX++] = 's';
                ptraccX[sLenAccX++] = ' ';
                ptraccX[sLenAccX++] = ' ';
                ptraccX[sLenAccX++] = ' ';

                ptraccX[sLenAccX++] = ptraccZ[0];
                ptraccX[sLenAccX++] = ptraccZ[1];
                ptraccX[sLenAccX++] = ptraccZ[2];

                ptraccX[sLenAccX++] = ' ';
                ptraccX[sLenAccX++] = ' ';
                ptraccX[sLenAccX++] = 'Z';
                ptraccX[sLenAccX++] = '-';
                ptraccX[sLenAccX++] = 'a';
                ptraccX[sLenAccX++] = 'x';
                ptraccX[sLenAccX++] = 'e';
                ptraccX[sLenAccX++] = 's';
                ptraccX[sLenAccX++] = ' ';
                ptraccX[sLenAccX++] = ' ';
                ptraccX[sLenAccX++] = ' ';

                //if(g_ucDryerRunning)  // g_ucDryerRunning is set in void ReadAccSensor()
                //{
                    //strcpy((char*)pSlHttpServerResponse->ResponseData.token_value.data,"Running");
                    //pSlHttpServerResponse->ResponseData.token_value.len += strlen("Running");
                    pSlHttpServerResponse->ResponseData.token_value.data = ptraccX;
                    pSlHttpServerResponse->ResponseData.token_value.len += sLenAccX;
                //}
                //else
                //{
                    //strcpy((char*)pSlHttpServerResponse->ResponseData.token_value.data,"Stopped");
                    //pSlHttpServerResponse->ResponseData.token_value.len += strlen("Stopped");
                //}
                    UART_PRINT("\t\t Accelerometer data is sent \n\r");
            }


