attacker145/CC3200-IoT/main.c
            /*
             * The New UART token ****************************New UART token*********************************** New UART token
            */
            if(memcmp(pSlHttpServerEvent->EventData.httpTokenName.data,
                    GET_token_URT, strlen((const char *)GET_token_URT)) == 0)
            {

                //UART_PRINT("\n\r\rExecuting UptimeTask Enter a string and press enter\n\r\r");
                uart = g_ucUARTRecvBuffer1; //80 characters long
                //uart = "Sending srings of data"; // works

                //short sLenuart = itoa(g_accXIntervalSum,"hello uart");
                //strcpy((char*)pSlHttpServerResponse->ResponseData.token_value.data,"hello uart");
                //pSlHttpServerResponse->ResponseData.token_value.len += strlen("hello uart");

                //strcpy((char*)pSlHttpServerResponse->ResponseData.token_value.data, (const char *) uart);
                //pSlHttpServerResponse->ResponseData.token_value.len += sLenuart;

                //strcpy((char*)pSlHttpServerResponse->ResponseData.token_value.data,"hello uart");	//Works
                //pSlHttpServerResponse->ResponseData.token_value.len += strlen("hello uart");		//Works

                strcpy((char*)pSlHttpServerResponse->ResponseData.token_value.data, (const char *) uart);	//Works
                pSlHttpServerResponse->ResponseData.token_value.len += strlen((const char *) uart);				//Works
            }




        }
            break;

        case SL_NETAPP_HTTPPOSTTOKENVALUE_EVENT:
        {
            unsigned char led, i;
            unsigned long delay = 1000000;
            unsigned char *ptr = pSlHttpServerEvent->EventData.httpPostData.token_name.data; // Get tocken name supplied by the SL_NETAPP_HTTPPOSTTOKENVALUE_EVENT
            UART_PRINT("\n\n\rHTTP_POST Tocken:\t %s", ptr);  // Print UART the tocken name
            //g_ucLEDStatus = 0;
            //memcmp ( buffer1, buffer2, sizeof(buffer1) );
            if(memcmp(ptr, POST_token, strlen((const char *)POST_token)) == 0) //"__SL_P_ULD"
            {
                // static unsigned char POST_token[] = "__SL_P_ULD";
                ptr = pSlHttpServerEvent->EventData.httpPostData.token_value.data;
                if(memcmp(ptr, "LED", 3) != 0)
                    break;
                ptr += 3;   // First 3 received characters are "LED"
                led = *ptr; // has character '1'
                ptr += 2;   // Skips the _ character sent by the web page
                if(led == '1')
                {
                    if(memcmp(ptr, "ON", 2) == 0)
                    {
                        GPIO_IF_LedOn(MCU_RED_LED_GPIO);
                        g_ucLEDStatus = LED_ON;

                    }
                    else if(memcmp(ptr, "Blink", 5) == 0) // com.TI.toggleLED('_Blink');
                    {

                    	//
                    	// Configure PIN_01 for GPIO Output
                    	//
                    	//PinTypeGPIO(PIN_01, PIN_MODE_0, false);
                    	//GPIODirModeSet(GPIOA1_BASE, 0x4, GPIO_DIR_MODE_OUT);

                    	//
                    	// Configure PIN_02 for GPIO Output
                    	//
                    	//PinTypeGPIO(PIN_02, PIN_MODE_0, false);
                    	//GPIODirModeSet(GPIOA1_BASE, 0x8, GPIO_DIR_MODE_OUT);

                    	//MAP_UtilsDelay(delay);

                    	for (i = 0; i < 50; i++){
                            GPIO_IF_LedOn(MCU_RED_LED_GPIO);        	// Turn On LED: RED pin64, GPIO9
                            MAP_UtilsDelay(delay);
                            GPIO_IF_LedOff(MCU_RED_LED_GPIO);       	// Turn Off LED: BLUE pin64, GPIO09
                            //MAP_UtilsDelay(delay);
                            //GPIO_IF_LedOn(MCU_ORANGE_LED_GPIO);        // Turn On ORANGE:
                            //MAP_UtilsDelay(delay);
                            //GPIO_IF_LedOff(MCU_ORANGE_LED_GPIO);       // Turn Off ORANGE:
                            //MAP_UtilsDelay(delay);
                            //GPIO_IF_LedOn(MCU_GREEN_LED_GPIO);        // Turn On ORANGE:
                            //MAP_UtilsDelay(delay);
                            //GPIO_IF_LedOff(MCU_GREEN_LED_GPIO);       // Turn Off ORANGE:
                            MAP_UtilsDelay(delay);
                            MAP_GPIOPinWrite(GPIOA3_BASE,0x10,0x10);
                            MAP_UtilsDelay(delay);
                            MAP_GPIOPinWrite(GPIOA2_BASE,0x40,0x40);
                            MAP_UtilsDelay(delay);
                            MAP_GPIOPinWrite(GPIOA3_BASE,0x10,0);
                            MAP_UtilsDelay(delay);
                            MAP_GPIOPinWrite(GPIOA2_BASE,0x40,0);
                            MAP_UtilsDelay(delay);
                        }
                        GPIO_IF_LedOn(MCU_RED_LED_GPIO);            // Turn On LED
                        MAP_GPIOPinWrite(GPIOA2_BASE,0x40,0x40);    // LED ON
                        MAP_GPIOPinWrite(GPIOA3_BASE,0x10,0);       // LED OFF
                        g_ucLEDStatus = LED_BLINK;

                        //
                        // Configure PIN_01 for I2C0 I2C_SCL
                        //
                        //PinTypeI2C(PIN_01, PIN_MODE_1);

                        //
                        // Configure PIN_02 for I2C0 I2C_SDA
                        //
                        //PinTypeI2C(PIN_02, PIN_MODE_1);

                        //MAP_UtilsDelay(delay);

                    }
                    else
                    {
                        GPIO_IF_LedOff(MCU_RED_LED_GPIO);
                        MAP_GPIOPinWrite(GPIOA3_BASE,0x10,0);
                        MAP_GPIOPinWrite(GPIOA2_BASE,0x40,0);
                        g_ucLEDStatus = LED_OFF;
                    }
                }
                else if(led == '2')
                {

                    if(memcmp(ptr, "ON", 2) == 0)
                    {
                        GPIO_IF_LedOn(MCU_ORANGE_LED_GPIO);
                        g_ucLEDStatus = LED_ON;
                    }
                    else if(memcmp(ptr, "Blink", 5) == 0)
                    {
                        GPIO_IF_LedOn(MCU_ORANGE_LED_GPIO);
                        g_ucLEDStatus = 1;
                        g_ucLEDStatus = LED_BLINK;
                    }
                    else
                    {
                        GPIO_IF_LedOff(MCU_ORANGE_LED_GPIO);
                        g_ucLEDStatus = LED_OFF;
                    }
                }

