attacker145/CC3200-IoT/main.c
}

//****************************************************************************
//
//!    \brief Exosite Application Main Task - Initializes SimpleLink Driver
//!                                           and Handles HTTP Requests
//! \param[in]                  pvParameters is the data passed to the Task
//!
//! \return                        None
//
//****************************************************************************
static void ExositeTask(void *pvParameters)
{
    long   ret = -1;
    unsigned long long retry_delay = 100;
    unsigned long long counter = 0;
    char buf[1024];
    char uid[13];
    unsigned long ulDestinationIP;
    EXO_STATE state = EXO_STATE_NOT_COMPLETE;

    //Read Device Mode Configuration
    ReadDeviceConfiguration(); // Reads pin 58 pull-up jumper and sets state to ROLE_STA = 0 or ROLE_AP = 2

    //Connect to Network
    ret = ConnectToNetwork();
    if(ret < 0)
    {
        ERR_PRINT(ret);
        LOOP_FOREVER();
    }

    // Wait here if we're in AP Mode
    while(g_uiDeviceModeConfig != ROLE_STA){
        osi_Sleep(1000);
    }



    //Handle Async Events
    while(1)
    {

        while(state != EXO_STATE_INIT_COMPLETE){

        	UART_PRINT("\r\n\nConnected to a network: Your code goes here here\r\n\n");
        	    	    //long lRetVal = -1;                  // Link return value

        	getUuid(uid);

        	UART_PRINT("MAC Address (uid) = %s\r\n\n", uid);

        	//
        	// Get the serverhost IP address using the DNS lookup
        	//
        	ret = Network_IF_GetHostIP((char*)HOST_NAME, &ulDestinationIP);//Error code -161 means ' No DNS server was specified' (#define SL_NET_APP_DNS_NO_SERVER   -161   @simplelink\include\netapp.h)
        	if(ret < 0)
        	{
        		UART_PRINT("DNS lookup failed. \n\r",ret);
        		//goto end;
        	}

        	//TODO: Wrap all Exosite calls in a check to see if we're connected.
            UART_PRINT("[EXO] Initializing Exosite\r\n");
            state = exosite_init("texasinstruments","cc3200lp_v1");
            if(state == EXO_STATE_INIT_COMPLETE){
                UART_PRINT("[EXO] Activated, Ready to Go\r\n");
            }else if(state == EXO_STATE_INIT_ERROR){
                UART_PRINT("[EXO] Error Activating on Exosite (Add to Account or Re-enable for Activation)\r\n");
                retry_delay *= 2;
                osi_Sleep(retry_delay);
            }else if(state == EXO_STATE_CONNECTION_ERROR){
                UART_PRINT("[EXO] Error Connecting to Exosite, Check Your Connection\r\n");
                //retry_delay *= 2;
                osi_Sleep(retry_delay);
            }else if(state == EXO_STATE_NO_RESPONSE){
                UART_PRINT("[EXO] We connected, but timed-out waiting for a response. Try again.\r\n");
                retry_delay *= 2;
                osi_Sleep(retry_delay);
            }else if(state == EXO_STATE_DEVICE_NOT_ENABLED){
                UART_PRINT("[EXO] Couldn't Activate on Exosite (Add to Account or Re-enable for Activation)\r\n");
                retry_delay *= 2;
                osi_Sleep(retry_delay);
            }else if(state == EXO_STATE_R_W_ERROR){
                UART_PRINT("[EXO] Read/Write Error\r\n");
                retry_delay *= 2;
                osi_Sleep(retry_delay);
            }else{
                UART_PRINT("[EXO] Unknown State in Init");
                return;
            }
        }


        UART_PRINT("[EXO] Writing Values...");

        AccSample(); // Just do a single reading for now. TODO: Make Async.
        SetAccAvg();

        float sensorTemp;
        TMP006DrvGetTemp(&sensorTemp);
        /*
         * Write formatted output to sized buffer
         * Composes a string with the same text that would be printed
         * if format was used on printf, but instead of being printed,
         * the content is stored as a C string in the buffer pointed by s (taking n as the maximum buffer capacity to fill).
         * If the resulting string would be longer than n-1 characters, the remaining characters are discarded and not stored,
         * but counted for the value returned by the function.
         * A terminating null character is automatically appended after the content written.
         * After the format parameter, the function expects at least as many additional arguments as needed for format.
         * %.0f - floating point zero decimal places
         */
        snprintf(buf, 1023, "ontime=%llu & acc=%.0f & accX=%.0f & accY=%.0f & accZ=%.0f & sensortemp=%.2f & usrsw=%llu",
                g_uptimeSec,
                g_accTotalAvg,
                g_accXAvg,
                g_accYAvg,
                g_accZAvg,
                sensorTemp,
                g_SW2Counter);                  // writes buf
        // %llu - unsigned long long
        ret = exosite_write(buf,strlen(buf));   // Writes the data buf[] in writeData to Exosite. !!!!!!!!!!!!!!!
        if(ret == 0){
            UART_PRINT("OK\r\n");
            retry_delay = 1000;
        }else{
            UART_PRINT("ERROR\r\n");
            retry_delay *= 2;
            state = EXO_STATE_NOT_COMPLETE;
            ERR_PRINT(ret);
        }

        //LED Actions for OOB Code
        if(g_ucLEDStatus == LED_ON)
        {
            GPIO_IF_LedOn(MCU_RED_LED_GPIO);        //Turn LED On
        }
        if(g_ucLEDStatus == LED_OFF)
        {
            GPIO_IF_LedOff(MCU_RED_LED_GPIO);       //Turn LED Off
        }
        if(g_ucLEDStatus==LED_BLINK)
        {
            GPIO_IF_LedToggle(MCU_RED_LED_GPIO);    //Toggle the Led state
        }



        // Limit Retry Delay to 10 Seconds During Development
        if(retry_delay > 10000)
            retry_delay = 10000;

        osi_Sleep(retry_delay);

        counter++;
    }
}

//*****************************************************************************
//
//! Sample the accelerometer.
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
static void AccSampleTask( void *pvParameters )
{
    while(1)
    {
        //GPIO_IF_LedOff(MCU_ORANGE_LED_GPIO);
        //GPIO_IF_LedOff(MCU_GREEN_LED_GPIO);
        AccSample();
        //UART_PRINT("Just got a new accelerometer data sample \n\r\r");
        //GPIO_IF_LedToggle(MCU_GREEN_LED_GPIO);
        osi_Sleep(100);
    }
}

//*****************************************************************************
//
//! Inc the uptime counter.
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
static void UptimeTask( void *pvParameters )
{
    while(1)
    {
    	g_uptimeSec++;
    	long   lRetVal = -1;
    	unsigned char ucPinValue;
    	unsigned int uiGPIOPort;
    	unsigned char pucGPIOPin;
    	//Read GPIO
    	GPIO_IF_GetPortNPin(SH_GPIO_22,&uiGPIOPort,&pucGPIOPin);
    	ucPinValue = GPIO_IF_Get(SH_GPIO_22,uiGPIOPort,pucGPIOPin);

    	if(ucPinValue == 1)
    	{
    		ReadDeviceConfiguration(); // Reads pin 58 pull-up jumper and sets state to ROLE_STA = 0 or ROLE_AP = 2
    		//Device is in STA Mode and Force AP Jumper is Connected
    		if(ROLE_AP != lRetVal && g_uiDeviceModeConfig == ROLE_AP )
    		{
    			UART_PRINT("\r\nConnectToNetwork: Current ST mode, the jumper is connected\r\n");
    			//Switch to AP Mode
    			lRetVal = ConfigureMode(ROLE_AP);
    			//UART_PRINT("\r\nConnectToNetwork: Switch to AP mode\r\n");
    			ASSERT_ON_ERROR( lRetVal);
    		}
    		// Wait here if we're in AP Mode
    		while(g_uiDeviceModeConfig != ROLE_STA){
    			osi_Sleep(1000);
    		}
    	}


        //UART_PRINT("\n\r\rExecuting UptimeTask\n\r\r");
        // Returns UART line read from the console. Parameter is unsigned char array
        //g_UartHaveCmd = GETChar(&g_ucUARTRecvBuffer1[0]);
        //UART_PRINT("\n\r\rExecuting UptimeTask Enter a string and press enter\n\r\r");

